vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC5504_DFP.pdsc
    <condition id="component.cmsis_drivers.condition_id">
      <require condition="allOf.device=LPC5504.internal_condition"/>
    </condition>
    <condition id="component.codec_adapters.condition_id">
      <require condition="allOf.device=LPC5504.internal_condition"/>
    </condition>
    <condition id="component.codec_i2c.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, device=LPC5504.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter_interface, device=LPC5504.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require condition="device.LPC5504.internal_condition"/>
    </condition>
    <condition id="component.cs42448_adapter.condition_id">
      <require condition="allOf.device=LPC5504.internal_condition"/>
    </condition>
    <condition id="component.cs42888_adapter.condition_id">
      <require condition="allOf.device=LPC5504.internal_condition"/>
    </condition>
    <condition id="component.ctimer_adapter.condition_id">
      <require condition="allOf.driver.ctimer, device=LPC5504.internal_condition"/>
    </condition>
    <condition id="allOf.driver.ctimer, device=LPC5504.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer"/>
      <require condition="device.LPC5504.internal_condition"/>
    </condition>
    <condition id="component.da7212_adapter.condition_id">
      <require condition="allOf.device=LPC5504.internal_condition"/>
    </condition>
    <condition id="component.eeprom_AT25Fxxxx.condition_id">
      <require condition="allOf.device=LPC5504.internal_condition"/>
    </condition>
    <condition id="component.eeprom_AT45DBxxxx.condition_id">
      <require condition="allOf.device=LPC5504.internal_condition"/>
    </condition>
    <condition id="component.eeprom_InternalFlash.condition_id">
      <require condition="allOf.device=LPC5504.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9544.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=LPC5504.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9548.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=LPC5504.internal_condition"/>
    </condition>
    <condition id="component.flexcomm_i2c_adapter.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, driver.flexcomm_i2c, device=LPC5504.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter_interface, driver.flexcomm_i2c, device=LPC5504.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.LPC5504.internal_condition"/>
    </condition>
    <condition id="component.flexcomm_spi_adapter.condition_id">
      <require condition="allOf.driver.common, driver.flexcomm_spi, device=LPC5504.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.flexcomm_spi, device=LPC5504.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require condition="device.LPC5504.internal_condition"/>
    </condition>
    <condition id="component.gint_adapter.condition_id">
      <require condition="allOf.driver.gint, device=LPC5504.internal_condition"/>
    </condition>
    <condition id="allOf.driver.gint, device=LPC5504.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gint"/>
      <require condition="device.LPC5504.internal_condition"/>
    </condition>
    <condition id="component.i2c_adapter_interface.condition_id">
      <require condition="allOf.anyOf=allOf=component.flexcomm_i2c_adapter, driver.flexcomm_i2c, device=LPC5504.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.flexcomm_i2c_adapter, driver.flexcomm_i2c, device=LPC5504.internal_condition">
      <require condition="anyOf.allOf=component.flexcomm_i2c_adapter, driver.flexcomm_i2c.internal_condition"/>
      <require condition="device.LPC5504.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.flexcomm_i2c_adapter, driver.flexcomm_i2c.internal_condition">
      <accept condition="allOf.component.flexcomm_i2c_adapter, driver.flexcomm_i2c.internal_condition"/>
    </condition>
    <condition id="allOf.component.flexcomm_i2c_adapter, driver.flexcomm_i2c.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_i2c_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="component.i2c_mux.condition_id">
      <require condition="allOf.device=LPC5504.internal_condition"/>
    </condition>
    <condition id="component.i2c_mux_pca954x.condition_id">
      <require condition="allOf.component.i2c_mux, device=LPC5504.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_mux, device=LPC5504.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux"/>
      <require condition="device.LPC5504.internal_condition"/>
    </condition>
    <condition id="component.led.condition_id">
      <require condition="allOf.anyOf=allOf=component.lpc_gpio_adapter, driver.lpc_gpio, component.timer_manager, driver.common, device=LPC5504.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.lpc_gpio_adapter, driver.lpc_gpio, component.timer_manager, driver.common, device=LPC5504.internal_condition">
      <require condition="anyOf.allOf=component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.LPC5504.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition">
      <accept condition="allOf.component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition"/>
    </condition>
    <condition id="component.lists.condition_id">
      <require condition="allOf.driver.common, device=LPC5504.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=LPC5504.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.LPC5504.internal_condition"/>
    </condition>
    <condition id="component.lpc_crc_adapter.condition_id">
      <require condition="allOf.driver.lpc_crc, device=LPC5504.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpc_crc, device=LPC5504.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_crc"/>
      <require condition="device.LPC5504.internal_condition"/>
    </condition>
    <condition id="component.lpc_gpio_adapter.condition_id">
      <require condition="allOf.driver.inputmux, driver.lpc_gpio, driver.pint, device=LPC5504.internal_condition"/>
    </condition>
    <condition id="allOf.driver.inputmux, driver.lpc_gpio, driver.pint, device=LPC5504.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pint"/>
      <require condition="device.LPC5504.internal_condition"/>
    </condition>
    <condition id="component.lpcrtc.condition_id">
      <require condition="allOf.driver.lpc_rtc, device=LPC5504.internal_condition"/>
    </condition>
